Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_DevelopiOSAppsSwift/DevelopiOSAppsSwift-level2.tmx
Source language: en_us
Languages: ja

source: Both the canvas and the preview are showing the same size screen (iPhone 7) and the same orientation (portrait).
ja: キャンバスとプレビューの両方とも、同じ大きさの画面（iPhone 7）と同じ方向（縦向き）を表示しています。

source: Build a Basic UI
ja: 基本的なUIを作る

source: Build the Basic UI
ja: 基本となるUIを造る

source: Building the UI
ja: UIを作る

source: Bundle Identifier: This value is automatically generated based on your product name and organization identifier.
ja: バンドル識別子：この値は、自動的にあなたの製品名と組織識別子に基づいて生成されます。

source: But even though you added all the necessary user interface elements to your table view cells, they’re showing up empty, just like before.
ja: しかしあなたがすべての必要なユーザインターフェイス要素をあなたのテーブルビューセルに加えたとしても、それらは空で現れています、ちょうど前のように。

source: But first, you need to connect the table view cell in your scene to the custom cell subclass you just created.
ja: しかしまず、あなたはあなたのシーン中のテーブルビューセルをあなたがちょうど作成したカスタムセルサブクラスと接続する必要があります。

source: But how do you quickly test whether the data saved successfully?
ja: しかしどうやってあなたは、データがうまく保存されたか素早くテストするのでしょうか？

source: But if it’s nil, the operator the returns the empty string ("") instead.
ja: しかしそれがnilならば、この演算子は空の文字列（""）をその代わりに返します。

source: But table views with a large number of rows display only a small fraction of their total items at a given time.
ja: しかし多数の行を持つテーブルビューは、それらの項目全体のほんの一部しか一度に表示しません。

source: But what happens if you try to create a Meal with incorrect values, like an empty name or a negative rating?
ja: しかしあなたがMealを不正な値、空の名前や負数の格付けなどで作成しようとするならば、何が起こるでしょうか？

source: But why are the user interface elements you added nested under View?
ja: しかしなぜあなたが加えたユーザインターフェイス要素が「View」の下に入れ子にされるのでしょう？

source: But you can take this a step further and keep users from accidentally trying to add meals without a name by disabling the Save button while they’re typing a meal name, and checking that they’ve specified a valid name before letting them dismiss the keyboard.
ja: しかしあなたはこれを１段先に進めて、ユーザが間違えて食事を名前なしで加える試みをしないようにできます、それは彼らが食事名をタイプしている間Saveボタンを使用不能にすること、そして彼らが有効な名前を指定したことを彼らにキーボードを片付けさせる前にチェックすることによってです。

source: Buttons always start in the normal state (not highlighted, selected, focused, or disabled).
ja: ボタンは、常に通常状態で始まります（強調、選択、フォーカス、または使用不能ではなく）

source: Buttons have five different states: normal, highlighted, focused, selected, and disabled.
ja: ボタンは、５つの異なる状態を持ちます：通常、強調、フォーカス、選択、そして使用不能。

source: By adopting the UITextFieldDelegate protocol, you tell the compiler that the ViewController class can act as a valid text field delegate.
ja: UITextFieldDelegateプロトコルを採用することによって、あなたはコンパイラにViewControllerクラスが有効なテキスト欄委任先としての役割を果たすことができると教えます。

source: By default, UITableViewController and its subclasses adopt the necessary protocols to make the table view controller both a data source (UITableViewDataSource protocol) and a delegate (UITableViewDelegate protocol) for its associated table view.
ja: 初期時様態で、UITableViewControllerとそれのサブクラスは必要なプロトコルに準拠することで、テーブルビューコントローラをそれの関連データビューに対するデータソース（UITableViewDataSourceプロトコル）と委任先（UITableViewDelegateプロトコル）の両方にします。

source: By default, the button modifies its appearance based on its state, for example a disabled button appears grayed out.
ja: 省略時では、ボタンはそれの外観をそれの状態に基づいて修正します、例えば使用不能ボタンはグレイアウトされて現れます。

source: By default, the table view controller uses dynamic data.
ja: 初期状態では、テーブルビューコントローラは動的データを使います。

source: By leaving it as internal access (the default), you can access it from any other class inside the app.
ja: それを内部アクセス（初期状態）のままにしておくことによって、あなたはそれにアプリの内部の何らかの他のクラスからアクセスできます。

source: By making meals a variable (var) instead of a constant, you make the array mutable, which means you can add items to it after you initialize it.
ja: mealsを定数ではなく変数（var）にすることで、あなたはこの配列を可変にします、それはあなたがそれを初期化した後にそれに項目を加えることができることを意味します。

source: By responding to user actions and populating views with content from the data model, controllers serve as a gateway for communication between the model and views.
ja: ユーザアクションへ応答することとビューをデータモデルからのコンテンツで満たすことによって、コントローラはモデルとビューの間の通信の関門の役目をします。

source: By the time the view controller’s viewDidLoad() method is called, the system has assigned valid values to all of the controller’s outlets, and you can safely access their contents.
ja: ビューコントローラの持つviewDidLoad()メソッドが呼び出されるまでに、システムは有効な値をコントローラの持つアウトレットの全てに割り当て終えます、そしてあなたは安全にそれらのコンテンツにアクセスできます。

source: Cancel a New Meal Addition
ja: 新しい食事の追加のキャンセル

source: Cancel an Edit to an Existing Meal
ja: 既存の食事への編集のキャンセル

source: Change the tableView(_:numberOfRowsInSection:) data source method to return the appropriate number of rows, and remove the warning comment.
ja: tableView(_:numberOfRowsInSection:)データソースメソッドを適切な行の数を返すように変更して、警告コメントを削除してください。

source: Change the class name to MealViewController.
ja: クラス名をMealViewControllerに変更してください。

source: Change the import statement to import UIKit instead of Foundation:
ja: インポート文を変更してUIKitをFoundationの代わりにインポートしてください：

source: Change the return value from 0 to 1, and remove the warning comment.
ja: 戻り値を0から1に変えてください、そして警告コメントを削除してください。

source: Choose unwindToMealListWithSender: from the shortcut menu.
ja: unwindToMealListWithSender:をショートカットメニューから選んでください。

source: Choose Clear Constraints to remove all constraints on the user interface elements, and then try following the previous instructions to set up the constraints again.
ja: Clear Constraintsを選択することで、ユーザインターフェイス要素上の全ての制約を取り除いてください、そしてそれから前の指示に従って制約を再び設定してみてください。

source: Choose Editor > Canvas, and make sure Show Bounds Rectangles is selected.
ja: Editor > Canvasを選んでください、そしてShow Bounds Rectanglesが選択されることを確かめてください。

source: Choose Editor > Embed In > Navigation Controller.
ja: Editor > Embed In > Navigation Controllerを選択してください。

source: Choose File > New > File (or press Command-N).
ja: File > New > Fileを選んでください（またはコマンド-Nを押します）。

source: Choose Reset to Suggested Constraints to have Xcode update your interface with a valid set of constraints.
ja: Reset to Suggested Constraintsを選択することで、Xcodeにあなたのインターフェイスを有効な制約ひとそろいで更新させてください。

source: Choose Show from the Action Segue menu.
ja: ShowをAction Segueメニューから選んでください。

source: Choose Show from the Selection Segue menu.
ja: ShowをSelection Segueメニューから選んでください。

source: Clean Up the Project
ja: プロジェクトの掃除

source: Click Connect.
ja: Connectをクリックしてください。

source: Click Create.
ja: Createをクリックします。

source: Click Get and then click Install App.
ja: 「入手」をクリックしてそれから「アプリをインストール」をクリックしてください。

source: Click Next.
ja: Nextをクリックしてください。

source: Click a meal from the meal list to navigate to the meal detail scene.
ja: 食事を食事リストからクリックして食事詳細シーンへと進んでください。

source: Click inside the text field and enter text using the onscreen keyboard (if you’d like, you can use your computer’s keyboard by choosing Hardware > Keyboard > Connect Hardware Keyboard).
ja: テキスト欄の内側をクリックしてテキストを画面上のキーボードを使って入力してください（あなたがそうしたいなら、あなたはあなたのコンビュータのキーボードをHardware > Keyboard > Connect Hardware Keyboardを選ぶことによって使うことができます）。

source: Click on the error icon to bring up more information about the error.
ja: エラーアイコンをクリックして、そのエラーについてさらなる情報を引き出してください。

source: Click the Add button.
ja: Addボタンをクリックしてください。

source: Click the Assistant button in the Xcode toolbar near the top right corner of Xcode to open the assistant editor.
ja: XcodeツールバーのAssistantボタンをXcodeの一番上右隅でクリックして、アシスタントエディタを開きます。

source: Click the Assistant button in the Xcode toolbar to open the assistant editor.
ja: AssistantボタンをXcodeツールバーにおいてクリックしてアシスタントエディタを開いてください。

source: Click the Run button, located in the top-left corner of the Xcode toolbar.
ja: Run（実行）ボタンをクリックしてください、Xcodeツールバーの一番上左の角にあります。

source: Click the error icon to bring up the fix-it.
ja: 修正案の提示のためエラーアイコンをクリックしてください。

source: Click the same star a second time.
ja: 同じ星をもう一度クリックしてください。

source: Click the test method to navigate to its code in the editor.
ja: テストメソッドをクリックして、それのコードをエディタで見ていってください。

source: Click the third star to change the rating to 3, for example.
ja: 例えば、３番目の星をクリックして格付けを３に変えてください。

source: Clicking any of the buttons at this point should still call ratingButtonTapped(_:) and change the button images appropriately.
ja: ボタンのどれかをクリックするとこの時点では依然としてratingButtonTapped(_:)が呼び出されます、そしてボタン画像は適切に変化します。

source: Closures in Swift are similar to blocks in C and Objective-C and to lambdas in other programming languages.
ja: SwiftでのクロージャはCとObjective-Cでのブロックに、そして他のプログラミング言語でのラムダに似ています

source: Cocoa Touch
ja: ココアタッチ

source: Code comments like this provide helpful hints and contextual information in source code files, but you don’t need them for this lesson.
ja: このようなコードコメントは、ソースコードファイルにおいて役に立つヒントと前後関係的な情報を提供します。

source: Configure the Navigation Bar for the Scenes
ja: ナビゲーションバーをシーンのために構成する

source: Congratulations!
ja: おめでとう！

source: Connect the Gesture Recognizer to Code
ja: ジェスチャリコグナイザをコードに接続する

source: Connect the Image View to Code
ja: イメージビューをコードに接続する

source: Connect the Rating Control to the View Controller
ja: 格付けコントロールをビューコントローラに接続する

source: Connect the Table Cell UI to Code
ja: テーブルセルUIをコードに接続する

source: Connect the UI to Code
ja: UIをコードに接続する

source: Connect the UI to Source Code
ja: UIをソースコードと接続する

source: Control-drag from the Cancel button on your canvas to the code display in the editor on the right, stopping the drag at the line just below the //MARK: Navigation comment in MealViewController.swift.
ja: あなたのキャンバス上のCancelボタンから右のエディタの中のコード表示へコントロール-ドラッグして、MealViewController.swiftの中の//MARK: Navigationコメントのすぐ下の行でドラッグをやめてください。

source: Control-drag from the Save button on your canvas to the code display in the editor on the right, stopping the drag at the line just below your ratingControl property in MealViewController.swift.
ja: あなたのキャンバス上のSaveボタンから右のエディタのコード表示までコントロール-ドラッグして、あなたのMealViewController.swiftの中のratingControlプロパティのすぐ下の行でドラッグをやめます。

source: Control-drag from the Set Default Label Text button on your canvas to the code display in the editor on the right, stopping the drag at the line below the comment you just added in ViewController.swift.
ja: あなたのキャンバス上のSet Default Label Textボタンから右のエディタのコード表示までコントロール-ドラッグして、あなたがまさにViewController.swiftに加えたコメントの下の行でドラッグをやめます。

source: Control-drag from the button to the meal detail scene.
ja: そのボタンから食事詳細シーンまでコントール-ドラッグしてください。

source: Control-drag from the gesture recognizer in the scene dock to the code display in the editor on the right, stopping the drag at the line below the //MARK: Actions comment in ViewController.swift.
ja: シーンドックのジェスチャリコグナイザから右のエディタのコード表示へコントロール-ドラッグして、ViewController.swiftの中の//MARK: Actionsコメントの下の行でドラッグをやめます。

source: Control-drag from the image view on your canvas to the code display in the editor on the right, stopping the drag at the line just below the nameLabel property in MealTableViewCell.swift.
ja: あなたのキャンバス上のイメージビューから右のエディタの中のコード表示へコントロール-ドラッグして、MealTableViewCell.swiftの中のnameLabelプロパティのすぐ下の行でドラッグをやめてください。

source: Control-drag from the image view on your canvas to the code display in the editor on the right, stopping the drag at the line just below the existing outlets in ViewController.swift.
ja: あなたのキャンバス上のイメージビューから右のエディタの中のコード表示へコントロール-ドラッグして、ViewController.swiftの中の既存のアウトレットのすぐ下の行でドラッグをやめてください。

source: Control-drag from the label on your canvas to the code display in the editor on the right, stopping the drag at the line below the comment you just added in MealTableViewCell.swift.
ja: あなたのキャンバス上のラベルから右のエディタのコード表示までコントロール-ドラッグして、あなたが今ViewController.swiftに加えたコメントの下の行でドラッグをやめます。

source: Control-drag from the label on your canvas to the code display in the editor on the right, stopping the drag at the line just below your nameTextField property in ViewController.swift.
ja: あなたのキャンバス上のラベルから右のエディタのコード表示までコントロール-ドラッグして、あなたのViewController.swiftの中のnameTextFieldプロパティのすぐ下の行でドラッグをやめます。

source: Control-drag from the rating control on your canvas to the code display in the editor on the right, stopping the drag at the line below the photoImageView property in ViewController.swift.
ja: あなたのキャンバス上の格付けコントロールから右のエディタの中のコード表示へコントロール-ドラッグして、ViewController.swiftの中のphotoImageViewプロパティの下の行でドラッグをやめてください。

source: Control-drag from the rating control on your canvas to the code display in the editor on the right, stopping the drag at the line just below the photoImageView property in MealTableViewCell.swift.
ja: あなたのキャンバス上の格付けコントロールから右のエディタの中のコード表示へコントロール-ドラッグして、MealTableViewCell.swiftの中のphotoImageViewプロパティのすぐ下の行でドラッグをやめてください。

source: Control-drag from the table view cell to the meal detail scene.
ja: そのテーブルビューセルから食事詳細シーンへとコントロール-ドラッグしてください。

source: Control-drag from the text field on your canvas to the code display in the editor on the right, stopping the drag at the line below the comment you just added in ViewController.swift.
ja: あなたのキャンバス上のテキスト欄から右のエディタのコード表示までコントロール-ドラッグして、あなたがまさにViewController.swiftに加えたコメントの下の行でドラッグをやめます。

source: Create Outlets for UI Elements
ja: UI要素のアウトレットを作成する

source: Create a Custom View
ja: カスタムビューの作成

source: Create a Data Model
ja: データモデルの作成

source: Create a Gesture Recognizer
ja: ジェスチャリコグナイザの作成

source: Create a New Project
ja: 新しいプロジェクトの作成

source: Create a Table View
ja: テーブルビューを作る

source: Create a data model
ja: データモデルの作成

source: Create a project in Xcode
ja: プロジェクトをXcodeで作成する

source: Create a structure to store string constants
ja: 構造体を作成して文字列定数を格納する

source: Create an Image Picker to Respond to User Taps
ja: イメージピッカーを作成してユーザタップに応答する

source: Create an Unwind Segue
ja: 巻き戻しセグエの作成

source: Create and associate custom source code files with elements in a storyboard
ja: カスタムソースコードを作成してストーリーボードの要素と結びつける

source: Create and design a custom table view cell
ja: カスタム（あつらえの）ビューセルの作成と設計

source: Create a second storyboard scene
ja: ２つ目のストーリーボードを作成する

source: Create segues between view controllers
ja: ビューコントローラ間のセグエ（遷移）を作成する

source: Create the Meal List
ja: 食事リストを作成する

source: Create outlet and action connections between UI elements in a storyboard and source code
ja: ストーリーボードの中のUI要素とソースコードの間のアウトレットおよびアクション接続

source: Creating new meals and editing existing meals are very similar operations.
ja: 新しい食事の作成と既存の食事の編集は、大変よく似た操作です。

source: Currently, the init(frame:) method has an error.
ja: 現在、init(frame:)に１つのエラーがあります。

source: Currently, the FoodTracker app gives users the ability to add a new meal to a list of meals.
ja: 目下、FoodTrackerアプリは、ユーザに新しい食事を食事リストに加える能力を与えます。

source: Debug messages contain information that may be useful during debugging or when troubleshooting specific problems.
ja: デバッグメッセージは、デバッグ中にまたは特定の問題を解決する時に有用であると思われる情報を含みます。

source: Debugging Auto layout
ja: 自動レイアウトをデバッグする

source: Decide whether you’d like to enable developer mode and follow the prompts.
ja: あなたが開発者モードを有効にしたいかどうかを決めてプロンプトに従ってください。

source: Define Your Data Model
ja: あなたのデータモデルの定義

source: Define a custom class
ja: カスタムクラスを定義する

source: Define an Action to Perform
ja: 実行されるアクション（動作）の定義

source: Delete the line that sets the text property of the label.
ja: ラベルのテキストプロパティを設定する行を削除してください。

source: Delete the template’s methods.
ja: テンプレートの持つメソッドを削除してください。

source: Delete the two lines of comments, and replace them with a call to the superclass’s implementation.
ja: ２つのコメント行を削除してください、そしてそれらをスーパークラスの持つ実装への呼び出しと置き換えてください：

source: Demonstrate a conceptual understanding of the difference between failable and nonfailable initializers
ja: 失敗できるそして失敗できないイニシャライザの間の違いの概念的理解を実地にうつす

source: Design Custom Table Cells
ja: カスタムテーブルセル設計

source: Despite the name, just because the system calls this method, it does not guarantee that the content view is visible.
ja: その名前にもかかわらず、システムがこのメソッドを呼び出すからといって、それはコンテンツビューが可視化されることを保証しません。

source: Despite the name, just because the system calls this method, it does not guarantee that the content view will become visible.
ja: その名前にもかかわらず、システムがこのメソッドを呼び出すからといって、それはコンテンツビューが可視化されるようになることを保証しません。

source: Developer mode allows Xcode access to certain debugging features without requiring you to enter your password each time.
ja: 開発者モードは、特定のデバッグ機能をXcodeが毎回あなたのパスワード入力をあなたに要求せずに利用できるようにします。

source: Devices: Universal
ja: デバイス（機器）：共通

source: Different presentation styles have different uses.
ja: 異なる提示形式は、異なる用途を持ちます。

source: Differentiate between push and modal navigation
ja: プッシュナビゲーションとモーダルナビゲーションの間の違いがわかる

source: Disable Saving When the User Doesn't Enter an Item Name
ja: ユーザが項目名を入力しないとき保存できないようにする

source: Dismiss a view controller
ja: ビューコントローラをかたづける

source: Dismiss view controllers based on their presentation style
ja: ビューコントローラをそれらの表現形式に基づいて片付ける

source: Display a Default Photo
ja: 初期写真を表示する

source: Display dynamic data in a table view
ja: 動的なデータをテーブルビューで表示する

source: Display the Custom View
ja: カスタムビューの表示

source: Display the Data
ja: データを表示する

source: Document Revision History
ja: 文書改定履歴

source: Don’t be overwhelmed by all of the pieces; each area is described in more detail when you need to use it.
ja: これらの部分部分の全てに圧倒されないで；各区画はあなたがそれを使う必要があるときにより詳細に説明されます。

source: Double-click the Fix-it to insert the override keyword.
ja: Fix-itをダブルクリックすることで、overrideキーワードを挿入してください。

source: Double-click the button and type Set Default Label Text.
ja: このボタンをダブルクリックしてSet Default Label Textとタイプしてください。

source: Double-click the fix it to update your initializer.
ja: その修正をダブルクリックしてあなたのイニシャライザを更新してください。

source: Double-click the folder name and rename it Rating Images.
ja: フォルダ名をダブルクリックして、それの名前をRating Imagesに変えてください。

source: Double-click the folder name and rename it Sample Images.
ja: フォルダ名をダブルクリックしてそれをSample Imagesに改名してください。

source: Double-click the image set name and rename it emptyStar.
ja: 画像セットの名前をダブルクリックして、その名前をemptyStarに変えてください。

source: Double-click the image set name and rename it filledStar.
ja: 画像セットの名前をダブルクリックして、その名前をfilledStarに変えてください。

source: Double-click the image set name and rename it highlightedStar.
ja: 画像セットの名前をダブルクリックして、その名前をhighlightedStarに変えてください。

source: Double-click the image set name and rename it to defaultPhoto.
ja: 画像セット名をダブルクリックして、それをdefaultPhotoに名前変更してください。

source: Double-click the image set name and rename it to a name you’ll remember when you’re writing it in code.
ja: その画像セット名をダブルクリックしてそれをある名前、あなたがコードに書く時思い出せるもの、に改名してください。

source: Double-click the label and type Meal Name.
ja: ラベルをダブルクリックしてMeal Nameと入力してください。

source: Double-click the navigation bar in the meal detail scene.
ja: ナビゲーションバーを食事詳細シーンにおいてダブルクリックしてください。

source: Double-click the navigation bar in the meal list scene.
ja: ナビゲーションバーを食事リストシーンにおいてダブルクリックしてください。

source: Download the latest version of Xcode on your Mac free from the App Store.
ja: 最新版のXcodeをご自由にAppストアからあなたのMacにダウンロードしてください。

source: Drag a Bar Button Item object from the Object library to the far left of the navigation bar in the meal detail scene.
ja: Bar Button Itemオブジェクトをオブジェクトライブラリからナビゲーションバーの左端へと食事詳細シーンにおいてドラッグしてください。

source: Drag a Bar Button Item object from the list to the far right of the navigation bar in the meal list scene.
ja: Bar Button Itemオブジェクトをこのリストから食事リストシーンのナビゲーションバーのずっと右へドラッグしてください。

source: Drag a Button object from the Object library to your scene.
ja: Buttonオブジェクトをオブジェクトライブラリからあなたのシーンへドラッグします。

source: Drag a Label object from the Object library to your scene.
ja: ラベルオブジェクトをオブジェクトライブラリからあなたのシーンにドラッグしてください。

source: Drag a Table View Controller object from the list, and drop it on the canvas to the left of the existing scene.
ja: Table View Controllerオブジェクトをドラッグして、それをキャンバス上で既存のシーンの左にドロップしてください。

source: Drag a Tap Gesture Recognizer object from the Object library to your scene, and place it on top of the image view.
ja: Tap Gesture Recognizerオブジェクトをオブジェクトライブラリからあなたのシーンにドラッグします、そしてそれをイメージビューの上に配置します。

source: Drag a Text Field object from the Object library to your scene.
ja: Text Fieldオブジェクトをオブジェクトライブラリからあなたのシーンへとドラッグしてください。

source: Drag an Image View object from the Object library to your scene so that it’s in the stack view below the button.
ja: Image Viewオブジェクトをオブジェクトライブラリからあなたのシーンへドラッグして、それがスタックビューの中のボタンの下になるようにします。

source: Drag and drop the image into the 2x slot in the image set.
ja: その画像を画像セットの2xの挿入位置にドラック＆ドロップしてください。

source: Drag and drop the images into the simulator.
ja: 画像をシミュレータへとドラッグ＆ドロップしてください。

source: Drag and resize the image view so that it’s square, flush against the left, top, and bottom of the cell.
ja: イメージビューをドラッグおよびサイズ調節して、それが正方形で、セルの左、上、そして下に対してくっつくようにしてください。

source: Drag another Bar Button Item object from the Object library to the far right of the navigation bar in the meal detail scene.
ja: もう１つのBar Button Itemオブジェクトをオブジェクトライブラリからナビゲーションバーの右端へと食事詳細シーンにおいてドラッグしてください。

source: Drag down the navigation controller between the meal list scene and the meal detail scene so you can see the new segue.
ja: ナビゲーションコントローラを食事シーンリストと食事詳細シーンとの間でドラッグして引き下げてください、それであなたは新しいセグエを見ることができます。

source: Drag the storyboard entry point from the meal detail scene to the meal list scene.
ja: ストーリーボードエントリポイントを食事詳細シーンから食事リストシーンへとドラッグしてください。

source: Drag the button so that it’s right below the text field and aligned with the left margin in the scene.
ja: そのボタンをドラッグして、それがテキスト欄のすぐ下、シーンの左端にそろうようにします。

source: Drag the label so that its lined up with the guidelines to the right side of the image view and to the top margin of the table view cell.
ja: ラベルをドラッグして、それがイメージビューの右側とテーブルビューセルの上余白のガイドラインと整列するようにしてください。

source: Drag the label so that it’s right above the text field and aligned with the left margin in the scene.
ja: そのラベルをドラッグして、それがテキスト欄のすぐ上、シーンの左端にそろうようにします。

source: Drag the stack view so that it’s below the label and aligned with the label’s left margin.
ja: このスタックビューをドラッグして、それがラベルの下で、ラベルのもつ左余白と整列するようにしてください。

source: Drag the text field so that it’s positioned in the top half of the scene and aligned with the left margin in the scene.
ja: テキスト欄をドラッグして、それがシーンの上半分のところに位置するように、そしてシーンの左端にそろうようにします。

source: During an app state transition—for example, app launch, transitioning to the background, and app termination—the application object calls the corresponding delegate method, giving your app an opportunity to respond.
ja: アプリの状態推移—例えば、アプリの起動、バックグラウンドへの移行、そしてアプリの終了など—の間に、アプリケーションオブジェクトは、該当するデリゲートメソッドを呼び出して、応答するのにふさわしい機会をあなたのアプリに与えます。

source: Each constant corresponds to one of the three properties of Meal.
ja: 各定数は、Mealの３つのプロパティのうちの１つに対応します。

source: Each lesson contains a tutorial and the conceptual information you need to complete it.
ja: 各レッスンは、指導科目とあなたがそれを成し遂げるのに必要とする概念的情報を含みます。

source: Each line performs the following steps:
ja: 各行は以下の行程を実行します：

source: Each method encodes data of the given type.
ja: 各メソッドは、与えられた型のデータをエンコードします。

source: Each of the delegate methods has a default behavior.
ja: デリゲートメソッドの各々は、省略時の挙動を持ちます。

source: Each row in a table view has one cell, and that cell determines the content that appears in that row and how that content is laid out.
ja: テーブルビューの各行は１つのセルを持ちます、そしてそのセルは、その行に現れる内容とその内容がどのように配置（レイアウト）されるかを決定します。

source: Each test should check for a specific, basic type of behavior.
ja: 各テストは、ある特定の、基本的な種類の挙動についてチェックするべきです。

source: Each view controller has a navigationItem property.
ja: 各ビューコントローラは、navigationItemプロパティを持ちます。

source: Edit the attributes of UI elements in a storyboard using the Attributes inspector
ja: ストーリーボードの中でUI要素の属性をAttributesインスペクタ（「属性」管理機能）を使って編集する

source: Edit the attributes of a segue in a storyboard using the Attributes inspector
ja: セグエの属性をストーリーボードにおいてAttributesインスペクタを使って編集する

source: Elements in a storyboard are linked to source code.
ja: ストーリーボードの中の要素は、ソースコードと繋がれます。

source: Embed an existing view controller within a navigation controller in a storyboard
ja: 既存のビューコントローラをストーリーボードにおいてナビゲーションコントローラ内部に埋め込む

source: Enable Editing of Existing Meals
ja: 既存の食事の編集を可能にする

source: Enable a table view controller’s editing mode.
ja: テーブルビューコントローラの持つ編集モードを有効にする。

source: Enabling this setting helps you understand exactly what’s going on in your view hierarchy.
ja: この設定を有効にすることは、あなたのビュー階層がどうなっているかあなたが正確に理解する助けとなります。

source: Enter your Apple ID and password when prompted.
ja: 入力を促される場合はあなたのApple IDとパスワードを入力します。

source: Errors and warnings appear as yellow triangle icons (warnings) and red circles (errors) next to the code.
ja: エラーと警告は、黄色い三角形アイコン（警告）と赤い丸（エラー）としてコードの隣に現れます。
